Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/include/proc/p32mk0512gpk064.h
extern volatile __IPC46bits_t IPC46bits __asm__ ("IPC46") __attribute__((section("sfrs"), address(0xBF810420)));
extern volatile uint32_t        IPC46CLR __attribute__((section("sfrs"),address(0xBF810424)));
extern volatile uint32_t        IPC46SET __attribute__((section("sfrs"),address(0xBF810428)));
extern volatile uint32_t        IPC46INV __attribute__((section("sfrs"),address(0xBF81042C)));
#define IPC47 IPC47
extern volatile uint32_t   IPC47 __attribute__((section("sfrs"), address(0xBF810430)));
typedef union {
  struct {
    uint32_t CAN4IS:2;
    uint32_t CAN4IP:3;
    uint32_t :3;
    uint32_t QEI3IS:2;
    uint32_t QEI3IP:3;
    uint32_t :3;
    uint32_t QEI4IS:2;
    uint32_t QEI4IP:3;
    uint32_t :3;
    uint32_t QEI5IS:2;
    uint32_t QEI5IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC47bits_t;
extern volatile __IPC47bits_t IPC47bits __asm__ ("IPC47") __attribute__((section("sfrs"), address(0xBF810430)));
extern volatile uint32_t        IPC47CLR __attribute__((section("sfrs"),address(0xBF810434)));
extern volatile uint32_t        IPC47SET __attribute__((section("sfrs"),address(0xBF810438)));
extern volatile uint32_t        IPC47INV __attribute__((section("sfrs"),address(0xBF81043C)));
#define IPC48 IPC48
extern volatile uint32_t   IPC48 __attribute__((section("sfrs"), address(0xBF810440)));
typedef union {
  struct {
    uint32_t QEI6IS:2;
    uint32_t QEI6IP:3;
    uint32_t :11;
    uint32_t I2C4BIS:2;
    uint32_t I2C4BIP:3;
    uint32_t :3;
    uint32_t I2C4SIS:2;
    uint32_t I2C4SIP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC48bits_t;
extern volatile __IPC48bits_t IPC48bits __asm__ ("IPC48") __attribute__((section("sfrs"), address(0xBF810440)));
extern volatile uint32_t        IPC48CLR __attribute__((section("sfrs"),address(0xBF810444)));
extern volatile uint32_t        IPC48SET __attribute__((section("sfrs"),address(0xBF810448)));
extern volatile uint32_t        IPC48INV __attribute__((section("sfrs"),address(0xBF81044C)));
#define IPC49 IPC49
extern volatile uint32_t   IPC49 __attribute__((section("sfrs"), address(0xBF810450)));
typedef union {
  struct {
    uint32_t I2C4MIS:2;
    uint32_t I2C4MIP:3;
    uint32_t :3;
    uint32_t IC10EIS:2;
    uint32_t IC10EIP:3;
    uint32_t :3;
    uint32_t IC10IS:2;
    uint32_t IC10IP:3;
    uint32_t :3;
    uint32_t OC10IS:2;
    uint32_t OC10IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC49bits_t;
extern volatile __IPC49bits_t IPC49bits __asm__ ("IPC49") __attribute__((section("sfrs"), address(0xBF810450)));
extern volatile uint32_t        IPC49CLR __attribute__((section("sfrs"),address(0xBF810454)));
extern volatile uint32_t        IPC49SET __attribute__((section("sfrs"),address(0xBF810458)));
extern volatile uint32_t        IPC49INV __attribute__((section("sfrs"),address(0xBF81045C)));
#define IPC50 IPC50
extern volatile uint32_t   IPC50 __attribute__((section("sfrs"), address(0xBF810460)));
typedef union {
  struct {
    uint32_t IC11EIS:2;
    uint32_t IC11EIP:3;
    uint32_t :3;
    uint32_t IC11IS:2;
    uint32_t IC11IP:3;
    uint32_t :3;
    uint32_t OC11IS:2;
    uint32_t OC11IP:3;
    uint32_t :3;
    uint32_t IC12EIS:2;
    uint32_t IC12EIP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC50bits_t;
extern volatile __IPC50bits_t IPC50bits __asm__ ("IPC50") __attribute__((section("sfrs"), address(0xBF810460)));
extern volatile uint32_t        IPC50CLR __attribute__((section("sfrs"),address(0xBF810464)));
extern volatile uint32_t        IPC50SET __attribute__((section("sfrs"),address(0xBF810468)));
extern volatile uint32_t        IPC50INV __attribute__((section("sfrs"),address(0xBF81046C)));
#define IPC51 IPC51
extern volatile uint32_t   IPC51 __attribute__((section("sfrs"), address(0xBF810470)));
typedef union {
  struct {
    uint32_t IC12IS:2;
    uint32_t IC12IP:3;
    uint32_t :3;
    uint32_t OC12IS:2;
    uint32_t OC12IP:3;
    uint32_t :3;
    uint32_t IC13EIS:2;
    uint32_t IC13EIP:3;
    uint32_t :3;
    uint32_t IC13IS:2;
    uint32_t IC13IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC51bits_t;
extern volatile __IPC51bits_t IPC51bits __asm__ ("IPC51") __attribute__((section("sfrs"), address(0xBF810470)));
extern volatile uint32_t        IPC51CLR __attribute__((section("sfrs"),address(0xBF810474)));
extern volatile uint32_t        IPC51SET __attribute__((section("sfrs"),address(0xBF810478)));
extern volatile uint32_t        IPC51INV __attribute__((section("sfrs"),address(0xBF81047C)));
#define IPC52 IPC52
extern volatile uint32_t   IPC52 __attribute__((section("sfrs"), address(0xBF810480)));
typedef union {
  struct {
    uint32_t OC13IS:2;
    uint32_t OC13IP:3;
    uint32_t :3;
    uint32_t IC14EIS:2;
    uint32_t IC14EIP:3;
    uint32_t :3;
    uint32_t IC14IS:2;
    uint32_t IC14IP:3;
    uint32_t :3;
    uint32_t OC14IS:2;
    uint32_t OC14IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC52bits_t;
extern volatile __IPC52bits_t IPC52bits __asm__ ("IPC52") __attribute__((section("sfrs"), address(0xBF810480)));
extern volatile uint32_t        IPC52CLR __attribute__((section("sfrs"),address(0xBF810484)));
extern volatile uint32_t        IPC52SET __attribute__((section("sfrs"),address(0xBF810488)));
extern volatile uint32_t        IPC52INV __attribute__((section("sfrs"),address(0xBF81048C)));
#define IPC53 IPC53
extern volatile uint32_t   IPC53 __attribute__((section("sfrs"), address(0xBF810490)));
typedef union {
  struct {
    uint32_t IC15EIS:2;
    uint32_t IC15EIP:3;
    uint32_t :3;
    uint32_t IC15IS:2;
    uint32_t IC15IP:3;
    uint32_t :3;
    uint32_t OC15IS:2;
    uint32_t OC15IP:3;
    uint32_t :3;
    uint32_t IC16EIS:2;
    uint32_t IC16EIP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC53bits_t;
extern volatile __IPC53bits_t IPC53bits __asm__ ("IPC53") __attribute__((section("sfrs"), address(0xBF810490)));
extern volatile uint32_t        IPC53CLR __attribute__((section("sfrs"),address(0xBF810494)));
extern volatile uint32_t        IPC53SET __attribute__((section("sfrs"),address(0xBF810498)));
extern volatile uint32_t        IPC53INV __attribute__((section("sfrs"),address(0xBF81049C)));
#define IPC54 IPC54
extern volatile uint32_t   IPC54 __attribute__((section("sfrs"), address(0xBF8104A0)));
typedef union {
  struct {
    uint32_t IC16IS:2;
    uint32_t IC16IP:3;
    uint32_t :3;
    uint32_t OC16IS:2;
    uint32_t OC16IP:3;
    uint32_t :3;
    uint32_t SPI3EIS:2;
    uint32_t SPI3EIP:3;
    uint32_t :3;
    uint32_t SPI3RXIS:2;
    uint32_t SPI3RXIP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC54bits_t;
extern volatile __IPC54bits_t IPC54bits __asm__ ("IPC54") __attribute__((section("sfrs"), address(0xBF8104A0)));
extern volatile uint32_t        IPC54CLR __attribute__((section("sfrs"),address(0xBF8104A4)));
extern volatile uint32_t        IPC54SET __attribute__((section("sfrs"),address(0xBF8104A8)));
extern volatile uint32_t        IPC54INV __attribute__((section("sfrs"),address(0xBF8104AC)));
#define IPC55 IPC55
extern volatile uint32_t   IPC55 __attribute__((section("sfrs"), address(0xBF8104B0)));
typedef union {
  struct {
    uint32_t SPI3TXIS:2;
    uint32_t SPI3TXIP:3;
    uint32_t :3;
    uint32_t SPI4EIS:2;
    uint32_t SPI4EIP:3;
    uint32_t :3;
    uint32_t SPI4RXIS:2;
    uint32_t SPI4RXIP:3;
    uint32_t :3;
    uint32_t SPI4TXIS:2;
    uint32_t SPI4TXIP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC55bits_t;
