Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/include/proc/p32mk0512gpk064.h
extern volatile __DEVEE3bits_t DEVEE3bits __asm__ ("DEVEE3") __attribute__((section("sfrs"), address(0xBFC4503C)));
#define ADEVCFG4 ADEVCFG4
extern volatile uint32_t   ADEVCFG4 __attribute__((section("sfrs"), address(0xBFC03F3C)));
typedef union {
  struct {
    uint32_t :24;
    uint32_t A1DIFFPR:2;
    uint32_t A2DIFFPR:2;
    uint32_t A3DIFFPR:2;
    uint32_t A5DIFFPR:2;
  };
  struct {
    uint32_t w:32;
  };
} __ADEVCFG4bits_t;
extern volatile __ADEVCFG4bits_t ADEVCFG4bits __asm__ ("ADEVCFG4") __attribute__((section("sfrs"), address(0xBFC03F3C)));
#define ADEVCFG3 ADEVCFG3
extern volatile uint32_t   ADEVCFG3 __attribute__((section("sfrs"), address(0xBFC03F40)));
typedef union {
  struct {
    uint32_t USERID:16;
    uint32_t :6;
    uint32_t FUSBIDIO2:1;
    uint32_t FVBUSIO2:1;
    uint32_t :3;
    uint32_t PGL1WAY:1;
    uint32_t PMDL1WAY:1;
    uint32_t IOL1WAY:1;
    uint32_t FUSBIDIO1:1;
    uint32_t FVBUSIO1:1;
  };
  struct {
    uint32_t w:32;
  };
} __ADEVCFG3bits_t;
extern volatile __ADEVCFG3bits_t ADEVCFG3bits __asm__ ("ADEVCFG3") __attribute__((section("sfrs"), address(0xBFC03F40)));
#define ADEVCFG2 ADEVCFG2
extern volatile uint32_t   ADEVCFG2 __attribute__((section("sfrs"), address(0xBFC03F44)));
typedef union {
  struct {
    uint32_t FPLLIDIV:3;
    uint32_t :1;
    uint32_t FPLLRNG:3;
    uint32_t FPLLICLK:1;
    uint32_t FPLLMULT:7;
    uint32_t :1;
    uint32_t FPLLODIV:3;
    uint32_t :1;
    uint32_t DSBOREN:1;
    uint32_t DSWDTPS:5;
    uint32_t DSWDTOSC:1;
    uint32_t DSWDTEN:1;
    uint32_t FDSEN:1;
    uint32_t BORSEL:1;
    uint32_t :1;
    uint32_t UPLLEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __ADEVCFG2bits_t;
extern volatile __ADEVCFG2bits_t ADEVCFG2bits __asm__ ("ADEVCFG2") __attribute__((section("sfrs"), address(0xBFC03F44)));
#define ADEVCFG1 ADEVCFG1
extern volatile uint32_t   ADEVCFG1 __attribute__((section("sfrs"), address(0xBFC03F48)));
typedef union {
  struct {
    uint32_t FNOSC:3;
    uint32_t DMTINTV:3;
    uint32_t FSOSCEN:1;
    uint32_t IESO:1;
    uint32_t POSCMOD:2;
    uint32_t OSCIOFNC:1;
    uint32_t :3;
    uint32_t FCKSM:2;
    uint32_t WDTPS:5;
    uint32_t WDTSPGM:1;
    uint32_t WINDIS:1;
    uint32_t FWDTEN:1;
    uint32_t FWDTWINSZ:2;
    uint32_t DMTCNT:5;
    uint32_t FDMTEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __ADEVCFG1bits_t;
extern volatile __ADEVCFG1bits_t ADEVCFG1bits __asm__ ("ADEVCFG1") __attribute__((section("sfrs"), address(0xBFC03F48)));
#define ADEVCFG0 ADEVCFG0
extern volatile uint32_t   ADEVCFG0 __attribute__((section("sfrs"), address(0xBFC03F4C)));
typedef union {
  struct {
    uint32_t DEBUG:2;
    uint32_t JTAGEN:1;
    uint32_t ICESEL:2;
    uint32_t TRCEN:1;
    uint32_t BOOTISA:1;
    uint32_t :1;
    uint32_t FECCCON:2;
    uint32_t FSLEEP:1;
    uint32_t :1;
    uint32_t DBGPER:3;
    uint32_t SMCLR:1;
    uint32_t SOSCGAIN:2;
    uint32_t SOSCBOOST:1;
    uint32_t POSCGAIN:2;
    uint32_t POSCBOOST:1;
    uint32_t POSCFGAIN:2;
    uint32_t POSCAGCDLY:2;
    uint32_t POSCAGCRNG:1;
    uint32_t POSCAGC:1;
    uint32_t :2;
    uint32_t EJTAGBEN:1;
  };
  struct {
    uint32_t FDEBUG:2;
  };
  struct {
    uint32_t w:32;
  };
} __ADEVCFG0bits_t;
extern volatile __ADEVCFG0bits_t ADEVCFG0bits __asm__ ("ADEVCFG0") __attribute__((section("sfrs"), address(0xBFC03F4C)));
#define ADEVCP ADEVCP
extern volatile uint32_t   ADEVCP __attribute__((section("sfrs"), address(0xBFC03F5C)));
typedef union {
  struct {
    uint32_t :28;
    uint32_t CP:1;
  };
  struct {
    uint32_t w:32;
  };
} __ADEVCPbits_t;
extern volatile __ADEVCPbits_t ADEVCPbits __asm__ ("ADEVCP") __attribute__((section("sfrs"), address(0xBFC03F5C)));
#define ADEVSIGN ADEVSIGN
extern volatile uint32_t   ADEVSIGN __attribute__((section("sfrs"), address(0xBFC03F6C)));
#define ASEQ ASEQ
extern volatile uint32_t   ASEQ __attribute__((section("sfrs"), address(0xBFC03F70)));
typedef union {
  struct {
    uint32_t TSEQ:16;
    uint32_t CSEQ:16;
  };
  struct {
    uint32_t w:32;
  };
} __ASEQbits_t;
extern volatile __ASEQbits_t ASEQbits __asm__ ("ASEQ") __attribute__((section("sfrs"), address(0xBFC03F70)));
#define AUBADEVCFG4 AUBADEVCFG4
extern volatile uint32_t   AUBADEVCFG4 __attribute__((section("sfrs"), address(0xBFC23F3C)));
typedef union {
  struct {
    uint32_t :24;
    uint32_t A1DIFFPR:2;
    uint32_t A2DIFFPR:2;
    uint32_t A3DIFFPR:2;
    uint32_t A5DIFFPR:2;
  };
  struct {
    uint32_t w:32;
  };
} __AUBADEVCFG4bits_t;
extern volatile __AUBADEVCFG4bits_t AUBADEVCFG4bits __asm__ ("AUBADEVCFG4") __attribute__((section("sfrs"), address(0xBFC23F3C)));
#define AUBADEVCFG3 AUBADEVCFG3
extern volatile uint32_t   AUBADEVCFG3 __attribute__((section("sfrs"), address(0xBFC23F40)));
typedef union {
  struct {
    uint32_t USERID:16;
    uint32_t :6;
    uint32_t FUSBIDIO2:1;
    uint32_t FVBUSIO2:1;
    uint32_t :3;
    uint32_t PGL1WAY:1;
    uint32_t PMDL1WAY:1;
    uint32_t IOL1WAY:1;
    uint32_t FUSBIDIO1:1;
    uint32_t FVBUSIO1:1;
  };
  struct {
    uint32_t w:32;
  };
} __AUBADEVCFG3bits_t;
extern volatile __AUBADEVCFG3bits_t AUBADEVCFG3bits __asm__ ("AUBADEVCFG3") __attribute__((section("sfrs"), address(0xBFC23F40)));
#define AUBADEVCFG2 AUBADEVCFG2
extern volatile uint32_t   AUBADEVCFG2 __attribute__((section("sfrs"), address(0xBFC23F44)));
typedef union {
  struct {
    uint32_t FPLLIDIV:3;
    uint32_t :1;
    uint32_t FPLLRNG:3;
    uint32_t FPLLICLK:1;
    uint32_t FPLLMULT:7;
    uint32_t :1;
    uint32_t FPLLODIV:3;
    uint32_t :1;
    uint32_t DSBOREN:1;
    uint32_t DSWDTPS:5;
    uint32_t DSWDTOSC:1;
    uint32_t DSWDTEN:1;
    uint32_t FDSEN:1;
    uint32_t BORSEL:1;
    uint32_t :1;
    uint32_t UPLLEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __AUBADEVCFG2bits_t;
extern volatile __AUBADEVCFG2bits_t AUBADEVCFG2bits __asm__ ("AUBADEVCFG2") __attribute__((section("sfrs"), address(0xBFC23F44)));
#define AUBADEVCFG1 AUBADEVCFG1
extern volatile uint32_t   AUBADEVCFG1 __attribute__((section("sfrs"), address(0xBFC23F48)));
typedef union {
  struct {
    uint32_t FNOSC:3;
    uint32_t DMTINTV:3;
    uint32_t FSOSCEN:1;
    uint32_t IESO:1;
    uint32_t POSCMOD:2;
    uint32_t OSCIOFNC:1;
    uint32_t :3;
    uint32_t FCKSM:2;
    uint32_t WDTPS:5;
    uint32_t WDTSPGM:1;
    uint32_t WINDIS:1;
    uint32_t FWDTEN:1;
    uint32_t FWDTWINSZ:2;
    uint32_t DMTCNT:5;
    uint32_t FDMTEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __AUBADEVCFG1bits_t;
extern volatile __AUBADEVCFG1bits_t AUBADEVCFG1bits __asm__ ("AUBADEVCFG1") __attribute__((section("sfrs"), address(0xBFC23F48)));
#define AUBADEVCFG0 AUBADEVCFG0
extern volatile uint32_t   AUBADEVCFG0 __attribute__((section("sfrs"), address(0xBFC23F4C)));
typedef union {
  struct {
    uint32_t DEBUG:2;
    uint32_t JTAGEN:1;
    uint32_t ICESEL:2;
    uint32_t TRCEN:1;
    uint32_t BOOTISA:1;
    uint32_t :1;
    uint32_t FECCCON:2;
    uint32_t FSLEEP:1;
    uint32_t :1;
    uint32_t DBGPER:3;
    uint32_t SMCLR:1;
    uint32_t SOSCGAIN:2;
    uint32_t SOSCBOOST:1;
    uint32_t POSCGAIN:2;
    uint32_t POSCBOOST:1;
    uint32_t POSCFGAIN:2;
    uint32_t POSCAGCDLY:2;
    uint32_t POSCAGCRNG:1;
    uint32_t POSCAGC:1;
    uint32_t :2;
    uint32_t EJTAGBEN:1;
  };
  struct {
    uint32_t FDEBUG:2;
  };
  struct {
    uint32_t w:32;
  };
} __AUBADEVCFG0bits_t;
