Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/include/proc/p32mk0512gpk064.h
#define _SDI1R_SDI1R_POSITION                    0x00000000
#define _SDI1R_SDI1R_MASK                        0x0000000F
#define _SDI1R_SDI1R_LENGTH                      0x00000004

#define _SS1R_SS1R_POSITION                      0x00000000
#define _SS1R_SS1R_MASK                          0x0000000F
#define _SS1R_SS1R_LENGTH                        0x00000004

#define _SDI2R_SDI2R_POSITION                    0x00000000
#define _SDI2R_SDI2R_MASK                        0x0000000F
#define _SDI2R_SDI2R_LENGTH                      0x00000004

#define _SS2R_SS2R_POSITION                      0x00000000
#define _SS2R_SS2R_MASK                          0x0000000F
#define _SS2R_SS2R_LENGTH                        0x00000004

#define _SCK3R_SCK3R_POSITION                    0x00000000
#define _SCK3R_SCK3R_MASK                        0x0000000F
#define _SCK3R_SCK3R_LENGTH                      0x00000004

#define _SDI3R_SDI3R_POSITION                    0x00000000
#define _SDI3R_SDI3R_MASK                        0x0000000F
#define _SDI3R_SDI3R_LENGTH                      0x00000004

#define _SS3R_SS3R_POSITION                      0x00000000
#define _SS3R_SS3R_MASK                          0x0000000F
#define _SS3R_SS3R_LENGTH                        0x00000004

#define _SCK4R_SCK4R_POSITION                    0x00000000
#define _SCK4R_SCK4R_MASK                        0x0000000F
#define _SCK4R_SCK4R_LENGTH                      0x00000004

#define _SDI4R_SDI4R_POSITION                    0x00000000
#define _SDI4R_SDI4R_MASK                        0x0000000F
#define _SDI4R_SDI4R_LENGTH                      0x00000004

#define _SS4R_SS4R_POSITION                      0x00000000
#define _SS4R_SS4R_MASK                          0x0000000F
#define _SS4R_SS4R_LENGTH                        0x00000004

#define _C1RXR_C1RXR_POSITION                    0x00000000
#define _C1RXR_C1RXR_MASK                        0x0000000F
#define _C1RXR_C1RXR_LENGTH                      0x00000004

#define _C2RXR_C2RXR_POSITION                    0x00000000
#define _C2RXR_C2RXR_MASK                        0x0000000F
#define _C2RXR_C2RXR_LENGTH                      0x00000004

#define _REFIR_REFIR_POSITION                    0x00000000
#define _REFIR_REFIR_MASK                        0x0000000F
#define _REFIR_REFIR_LENGTH                      0x00000004

#define _IC10R_IC10R_POSITION                    0x00000000
#define _IC10R_IC10R_MASK                        0x0000000F
#define _IC10R_IC10R_LENGTH                      0x00000004

#define _IC11R_IC11R_POSITION                    0x00000000
#define _IC11R_IC11R_MASK                        0x0000000F
#define _IC11R_IC11R_LENGTH                      0x00000004

#define _IC12R_IC12R_POSITION                    0x00000000
#define _IC12R_IC12R_MASK                        0x0000000F
#define _IC12R_IC12R_LENGTH                      0x00000004

#define _IC13R_IC13R_POSITION                    0x00000000
#define _IC13R_IC13R_MASK                        0x0000000F
#define _IC13R_IC13R_LENGTH                      0x00000004

#define _IC14R_IC14R_POSITION                    0x00000000
#define _IC14R_IC14R_MASK                        0x0000000F
#define _IC14R_IC14R_LENGTH                      0x00000004

#define _IC15R_IC15R_POSITION                    0x00000000
#define _IC15R_IC15R_MASK                        0x0000000F
#define _IC15R_IC15R_LENGTH                      0x00000004

#define _IC16R_IC16R_POSITION                    0x00000000
#define _IC16R_IC16R_MASK                        0x0000000F
#define _IC16R_IC16R_LENGTH                      0x00000004

#define _SCK5R_SCK5R_POSITION                    0x00000000
#define _SCK5R_SCK5R_MASK                        0x0000000F
#define _SCK5R_SCK5R_LENGTH                      0x00000004

#define _SDI5R_SDI5R_POSITION                    0x00000000
#define _SDI5R_SDI5R_MASK                        0x0000000F
#define _SDI5R_SDI5R_LENGTH                      0x00000004

#define _SS5R_SS5R_POSITION                      0x00000000
#define _SS5R_SS5R_MASK                          0x0000000F
#define _SS5R_SS5R_LENGTH                        0x00000004

#define _SCK6R_SCK6R_POSITION                    0x00000000
#define _SCK6R_SCK6R_MASK                        0x0000000F
#define _SCK6R_SCK6R_LENGTH                      0x00000004

#define _SDI6R_SDI6R_POSITION                    0x00000000
#define _SDI6R_SDI6R_MASK                        0x0000000F
#define _SDI6R_SDI6R_LENGTH                      0x00000004

#define _SS6R_SS6R_POSITION                      0x00000000
#define _SS6R_SS6R_MASK                          0x0000000F
#define _SS6R_SS6R_LENGTH                        0x00000004

#define _C3RXR_C3RXR_POSITION                    0x00000000
#define _C3RXR_C3RXR_MASK                        0x0000000F
#define _C3RXR_C3RXR_LENGTH                      0x00000004

#define _C4RXR_C4RXR_POSITION                    0x00000000
#define _C4RXR_C4RXR_MASK                        0x0000000F
#define _C4RXR_C4RXR_LENGTH                      0x00000004

#define _RPA0R_RPA0R_POSITION                    0x00000000
#define _RPA0R_RPA0R_MASK                        0x0000001F
#define _RPA0R_RPA0R_LENGTH                      0x00000005

#define _RPA1R_RPA1R_POSITION                    0x00000000
#define _RPA1R_RPA1R_MASK                        0x0000001F
#define _RPA1R_RPA1R_LENGTH                      0x00000005

#define _RPA2R_RPA2R_POSITION                    0x00000000
#define _RPA2R_RPA2R_MASK                        0x0000001F
#define _RPA2R_RPA2R_LENGTH                      0x00000005

#define _RPA3R_RPA3R_POSITION                    0x00000000
#define _RPA3R_RPA3R_MASK                        0x0000001F
#define _RPA3R_RPA3R_LENGTH                      0x00000005

#define _RPA4R_RPA4R_POSITION                    0x00000000
#define _RPA4R_RPA4R_MASK                        0x0000001F
#define _RPA4R_RPA4R_LENGTH                      0x00000005

#define _RPA7R_RPA7R_POSITION                    0x00000000
#define _RPA7R_RPA7R_MASK                        0x0000001F
#define _RPA7R_RPA7R_LENGTH                      0x00000005

#define _RPA8R_RPA8R_POSITION                    0x00000000
#define _RPA8R_RPA8R_MASK                        0x0000001F
#define _RPA8R_RPA8R_LENGTH                      0x00000005

#define _RPA11R_RPA11R_POSITION                  0x00000000
#define _RPA11R_RPA11R_MASK                      0x0000001F
#define _RPA11R_RPA11R_LENGTH                    0x00000005

#define _RPA12R_RPA12R_POSITION                  0x00000000
#define _RPA12R_RPA12R_MASK                      0x0000001F
#define _RPA12R_RPA12R_LENGTH                    0x00000005

#define _RPA14R_RPA14R_POSITION                  0x00000000
#define _RPA14R_RPA14R_MASK                      0x0000001F
#define _RPA14R_RPA14R_LENGTH                    0x00000005

#define _RPA15R_RPA15R_POSITION                  0x00000000
#define _RPA15R_RPA15R_MASK                      0x0000001F
#define _RPA15R_RPA15R_LENGTH                    0x00000005

#define _RPB0R_RPB0R_POSITION                    0x00000000
#define _RPB0R_RPB0R_MASK                        0x0000001F
#define _RPB0R_RPB0R_LENGTH                      0x00000005

#define _RPB1R_RPB1R_POSITION                    0x00000000
#define _RPB1R_RPB1R_MASK                        0x0000001F
#define _RPB1R_RPB1R_LENGTH                      0x00000005

#define _RPB2R_RPB2R_POSITION                    0x00000000
#define _RPB2R_RPB2R_MASK                        0x0000001F
#define _RPB2R_RPB2R_LENGTH                      0x00000005

#define _RPB3R_RPB3R_POSITION                    0x00000000
#define _RPB3R_RPB3R_MASK                        0x0000001F
#define _RPB3R_RPB3R_LENGTH                      0x00000005

