Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/include/proc/p32mk0512gpk064.h
#define _IPC52_IC14IS_POSITION                   0x00000010
#define _IPC52_IC14IS_MASK                       0x00030000
#define _IPC52_IC14IS_LENGTH                     0x00000002

#define _IPC52_IC14IP_POSITION                   0x00000012
#define _IPC52_IC14IP_MASK                       0x001C0000
#define _IPC52_IC14IP_LENGTH                     0x00000003

#define _IPC52_OC14IS_POSITION                   0x00000018
#define _IPC52_OC14IS_MASK                       0x03000000
#define _IPC52_OC14IS_LENGTH                     0x00000002

#define _IPC52_OC14IP_POSITION                   0x0000001A
#define _IPC52_OC14IP_MASK                       0x1C000000
#define _IPC52_OC14IP_LENGTH                     0x00000003

#define _IPC52_w_POSITION                        0x00000000
#define _IPC52_w_MASK                            0xFFFFFFFF
#define _IPC52_w_LENGTH                          0x00000020

#define _IPC53_IC15EIS_POSITION                  0x00000000
#define _IPC53_IC15EIS_MASK                      0x00000003
#define _IPC53_IC15EIS_LENGTH                    0x00000002

#define _IPC53_IC15EIP_POSITION                  0x00000002
#define _IPC53_IC15EIP_MASK                      0x0000001C
#define _IPC53_IC15EIP_LENGTH                    0x00000003

#define _IPC53_IC15IS_POSITION                   0x00000008
#define _IPC53_IC15IS_MASK                       0x00000300
#define _IPC53_IC15IS_LENGTH                     0x00000002

#define _IPC53_IC15IP_POSITION                   0x0000000A
#define _IPC53_IC15IP_MASK                       0x00001C00
#define _IPC53_IC15IP_LENGTH                     0x00000003

#define _IPC53_OC15IS_POSITION                   0x00000010
#define _IPC53_OC15IS_MASK                       0x00030000
#define _IPC53_OC15IS_LENGTH                     0x00000002

#define _IPC53_OC15IP_POSITION                   0x00000012
#define _IPC53_OC15IP_MASK                       0x001C0000
#define _IPC53_OC15IP_LENGTH                     0x00000003

#define _IPC53_IC16EIS_POSITION                  0x00000018
#define _IPC53_IC16EIS_MASK                      0x03000000
#define _IPC53_IC16EIS_LENGTH                    0x00000002

#define _IPC53_IC16EIP_POSITION                  0x0000001A
#define _IPC53_IC16EIP_MASK                      0x1C000000
#define _IPC53_IC16EIP_LENGTH                    0x00000003

#define _IPC53_w_POSITION                        0x00000000
#define _IPC53_w_MASK                            0xFFFFFFFF
#define _IPC53_w_LENGTH                          0x00000020

#define _IPC54_IC16IS_POSITION                   0x00000000
#define _IPC54_IC16IS_MASK                       0x00000003
#define _IPC54_IC16IS_LENGTH                     0x00000002

#define _IPC54_IC16IP_POSITION                   0x00000002
#define _IPC54_IC16IP_MASK                       0x0000001C
#define _IPC54_IC16IP_LENGTH                     0x00000003

#define _IPC54_OC16IS_POSITION                   0x00000008
#define _IPC54_OC16IS_MASK                       0x00000300
#define _IPC54_OC16IS_LENGTH                     0x00000002

#define _IPC54_OC16IP_POSITION                   0x0000000A
#define _IPC54_OC16IP_MASK                       0x00001C00
#define _IPC54_OC16IP_LENGTH                     0x00000003

#define _IPC54_SPI3EIS_POSITION                  0x00000010
#define _IPC54_SPI3EIS_MASK                      0x00030000
#define _IPC54_SPI3EIS_LENGTH                    0x00000002

#define _IPC54_SPI3EIP_POSITION                  0x00000012
#define _IPC54_SPI3EIP_MASK                      0x001C0000
#define _IPC54_SPI3EIP_LENGTH                    0x00000003

#define _IPC54_SPI3RXIS_POSITION                 0x00000018
#define _IPC54_SPI3RXIS_MASK                     0x03000000
#define _IPC54_SPI3RXIS_LENGTH                   0x00000002

#define _IPC54_SPI3RXIP_POSITION                 0x0000001A
#define _IPC54_SPI3RXIP_MASK                     0x1C000000
#define _IPC54_SPI3RXIP_LENGTH                   0x00000003

#define _IPC54_w_POSITION                        0x00000000
#define _IPC54_w_MASK                            0xFFFFFFFF
#define _IPC54_w_LENGTH                          0x00000020

#define _IPC55_SPI3TXIS_POSITION                 0x00000000
#define _IPC55_SPI3TXIS_MASK                     0x00000003
#define _IPC55_SPI3TXIS_LENGTH                   0x00000002

#define _IPC55_SPI3TXIP_POSITION                 0x00000002
#define _IPC55_SPI3TXIP_MASK                     0x0000001C
#define _IPC55_SPI3TXIP_LENGTH                   0x00000003

#define _IPC55_SPI4EIS_POSITION                  0x00000008
#define _IPC55_SPI4EIS_MASK                      0x00000300
#define _IPC55_SPI4EIS_LENGTH                    0x00000002

#define _IPC55_SPI4EIP_POSITION                  0x0000000A
#define _IPC55_SPI4EIP_MASK                      0x00001C00
#define _IPC55_SPI4EIP_LENGTH                    0x00000003

#define _IPC55_SPI4RXIS_POSITION                 0x00000010
#define _IPC55_SPI4RXIS_MASK                     0x00030000
#define _IPC55_SPI4RXIS_LENGTH                   0x00000002

#define _IPC55_SPI4RXIP_POSITION                 0x00000012
#define _IPC55_SPI4RXIP_MASK                     0x001C0000
#define _IPC55_SPI4RXIP_LENGTH                   0x00000003

#define _IPC55_SPI4TXIS_POSITION                 0x00000018
#define _IPC55_SPI4TXIS_MASK                     0x03000000
#define _IPC55_SPI4TXIS_LENGTH                   0x00000002

#define _IPC55_SPI4TXIP_POSITION                 0x0000001A
#define _IPC55_SPI4TXIP_MASK                     0x1C000000
#define _IPC55_SPI4TXIP_LENGTH                   0x00000003

#define _IPC55_w_POSITION                        0x00000000
#define _IPC55_w_MASK                            0xFFFFFFFF
#define _IPC55_w_LENGTH                          0x00000020

#define _IPC56_SPI5EIS_POSITION                  0x00000000
#define _IPC56_SPI5EIS_MASK                      0x00000003
#define _IPC56_SPI5EIS_LENGTH                    0x00000002

#define _IPC56_SPI5EIP_POSITION                  0x00000002
#define _IPC56_SPI5EIP_MASK                      0x0000001C
#define _IPC56_SPI5EIP_LENGTH                    0x00000003

#define _IPC56_SPI5RXIS_POSITION                 0x00000008
#define _IPC56_SPI5RXIS_MASK                     0x00000300
#define _IPC56_SPI5RXIS_LENGTH                   0x00000002

#define _IPC56_SPI5RXIP_POSITION                 0x0000000A
#define _IPC56_SPI5RXIP_MASK                     0x00001C00
#define _IPC56_SPI5RXIP_LENGTH                   0x00000003

