Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/include/proc/p32mk0512gpk064.h
#define _ADCCMPCON4_IEBTWN_POSITION              0x00000004
#define _ADCCMPCON4_IEBTWN_MASK                  0x00000010
#define _ADCCMPCON4_IEBTWN_LENGTH                0x00000001

#define _ADCCMPCON4_DCMPED_POSITION              0x00000005
#define _ADCCMPCON4_DCMPED_MASK                  0x00000020
#define _ADCCMPCON4_DCMPED_LENGTH                0x00000001

#define _ADCCMPCON4_DCMPGIEN_POSITION            0x00000006
#define _ADCCMPCON4_DCMPGIEN_MASK                0x00000040
#define _ADCCMPCON4_DCMPGIEN_LENGTH              0x00000001

#define _ADCCMPCON4_ENDCMP_POSITION              0x00000007
#define _ADCCMPCON4_ENDCMP_MASK                  0x00000080
#define _ADCCMPCON4_ENDCMP_LENGTH                0x00000001

#define _ADCCMPCON4_AINID_POSITION               0x00000008
#define _ADCCMPCON4_AINID_MASK                   0x00001F00
#define _ADCCMPCON4_AINID_LENGTH                 0x00000005

#define _ADCBASE_ADCBASE_POSITION                0x00000000
#define _ADCBASE_ADCBASE_MASK                    0x0000FFFF
#define _ADCBASE_ADCBASE_LENGTH                  0x00000010

#define _ADCDSTAT_RAF0_POSITION                  0x00000000
#define _ADCDSTAT_RAF0_MASK                      0x00000001
#define _ADCDSTAT_RAF0_LENGTH                    0x00000001

#define _ADCDSTAT_RAF1_POSITION                  0x00000001
#define _ADCDSTAT_RAF1_MASK                      0x00000002
#define _ADCDSTAT_RAF1_LENGTH                    0x00000001

#define _ADCDSTAT_RAF2_POSITION                  0x00000002
#define _ADCDSTAT_RAF2_MASK                      0x00000004
#define _ADCDSTAT_RAF2_LENGTH                    0x00000001

#define _ADCDSTAT_RAF3_POSITION                  0x00000003
#define _ADCDSTAT_RAF3_MASK                      0x00000008
#define _ADCDSTAT_RAF3_LENGTH                    0x00000001

#define _ADCDSTAT_RAF4_POSITION                  0x00000004
#define _ADCDSTAT_RAF4_MASK                      0x00000010
#define _ADCDSTAT_RAF4_LENGTH                    0x00000001

#define _ADCDSTAT_RAF5_POSITION                  0x00000005
#define _ADCDSTAT_RAF5_MASK                      0x00000020
#define _ADCDSTAT_RAF5_LENGTH                    0x00000001

#define _ADCDSTAT_RAFIEN0_POSITION               0x00000008
#define _ADCDSTAT_RAFIEN0_MASK                   0x00000100
#define _ADCDSTAT_RAFIEN0_LENGTH                 0x00000001

#define _ADCDSTAT_RAFIEN1_POSITION               0x00000009
#define _ADCDSTAT_RAFIEN1_MASK                   0x00000200
#define _ADCDSTAT_RAFIEN1_LENGTH                 0x00000001

#define _ADCDSTAT_RAFIEN2_POSITION               0x0000000A
#define _ADCDSTAT_RAFIEN2_MASK                   0x00000400
#define _ADCDSTAT_RAFIEN2_LENGTH                 0x00000001

#define _ADCDSTAT_RAFIEN3_POSITION               0x0000000B
#define _ADCDSTAT_RAFIEN3_MASK                   0x00000800
#define _ADCDSTAT_RAFIEN3_LENGTH                 0x00000001

#define _ADCDSTAT_RAFIEN4_POSITION               0x0000000C
#define _ADCDSTAT_RAFIEN4_MASK                   0x00001000
#define _ADCDSTAT_RAFIEN4_LENGTH                 0x00000001

#define _ADCDSTAT_RAFIEN5_POSITION               0x0000000D
#define _ADCDSTAT_RAFIEN5_MASK                   0x00002000
#define _ADCDSTAT_RAFIEN5_LENGTH                 0x00000001

#define _ADCDSTAT_DMACEN_POSITION                0x0000000F
#define _ADCDSTAT_DMACEN_MASK                    0x00008000
#define _ADCDSTAT_DMACEN_LENGTH                  0x00000001

#define _ADCDSTAT_RBF0_POSITION                  0x00000010
#define _ADCDSTAT_RBF0_MASK                      0x00010000
#define _ADCDSTAT_RBF0_LENGTH                    0x00000001

#define _ADCDSTAT_RBF1_POSITION                  0x00000011
#define _ADCDSTAT_RBF1_MASK                      0x00020000
#define _ADCDSTAT_RBF1_LENGTH                    0x00000001

#define _ADCDSTAT_RBF2_POSITION                  0x00000012
#define _ADCDSTAT_RBF2_MASK                      0x00040000
#define _ADCDSTAT_RBF2_LENGTH                    0x00000001

#define _ADCDSTAT_RBF3_POSITION                  0x00000013
#define _ADCDSTAT_RBF3_MASK                      0x00080000
#define _ADCDSTAT_RBF3_LENGTH                    0x00000001

#define _ADCDSTAT_RBF4_POSITION                  0x00000014
#define _ADCDSTAT_RBF4_MASK                      0x00100000
#define _ADCDSTAT_RBF4_LENGTH                    0x00000001

#define _ADCDSTAT_RBF5_POSITION                  0x00000015
#define _ADCDSTAT_RBF5_MASK                      0x00200000
#define _ADCDSTAT_RBF5_LENGTH                    0x00000001

#define _ADCDSTAT_WOVERR_POSITION                0x00000017
#define _ADCDSTAT_WOVERR_MASK                    0x00800000
#define _ADCDSTAT_WOVERR_LENGTH                  0x00000001

#define _ADCDSTAT_RBFIEN0_POSITION               0x00000018
#define _ADCDSTAT_RBFIEN0_MASK                   0x01000000
#define _ADCDSTAT_RBFIEN0_LENGTH                 0x00000001

#define _ADCDSTAT_RBFIEN1_POSITION               0x00000019
#define _ADCDSTAT_RBFIEN1_MASK                   0x02000000
#define _ADCDSTAT_RBFIEN1_LENGTH                 0x00000001

#define _ADCDSTAT_RBFIEN2_POSITION               0x0000001A
#define _ADCDSTAT_RBFIEN2_MASK                   0x04000000
#define _ADCDSTAT_RBFIEN2_LENGTH                 0x00000001

#define _ADCDSTAT_RBFIEN3_POSITION               0x0000001B
#define _ADCDSTAT_RBFIEN3_MASK                   0x08000000
#define _ADCDSTAT_RBFIEN3_LENGTH                 0x00000001

#define _ADCDSTAT_RBFIEN4_POSITION               0x0000001C
#define _ADCDSTAT_RBFIEN4_MASK                   0x10000000
#define _ADCDSTAT_RBFIEN4_LENGTH                 0x00000001

#define _ADCDSTAT_RBFIEN5_POSITION               0x0000001D
#define _ADCDSTAT_RBFIEN5_MASK                   0x20000000
#define _ADCDSTAT_RBFIEN5_LENGTH                 0x00000001

#define _ADCDSTAT_DMAEN_POSITION                 0x0000001F
#define _ADCDSTAT_DMAEN_MASK                     0x80000000
#define _ADCDSTAT_DMAEN_LENGTH                   0x00000001

#define _ADCCNTB_ADCCNTB_POSITION                0x00000000
#define _ADCCNTB_ADCCNTB_MASK                    0xFFFFFFFF
#define _ADCCNTB_ADCCNTB_LENGTH                  0x00000020

#define _ADCDMAB_ADCDMAB_POSITION                0x00000000
#define _ADCDMAB_ADCDMAB_MASK                    0xFFFFFFFF
#define _ADCDMAB_ADCDMAB_LENGTH                  0x00000020

#define _ADCTRGSNS_LVL0_POSITION                 0x00000000
#define _ADCTRGSNS_LVL0_MASK                     0x00000001
#define _ADCTRGSNS_LVL0_LENGTH                   0x00000001

#define _ADCTRGSNS_LVL1_POSITION                 0x00000001
#define _ADCTRGSNS_LVL1_MASK                     0x00000002
#define _ADCTRGSNS_LVL1_LENGTH                   0x00000001

